Revit 2027 API
WireConduitTypeSet.Contains Method
Tests for the existence of a conduit type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	WireConduitType item
)
Public Overridable Function Contains (
	item As WireConduitType
) As Boolean
public:
virtual bool Contains(
	WireConduitType^ item
)
abstract Contains :
        item : WireConduitType -> bool
override Contains :
        item : WireConduitType -> bool
Parameters
item WireConduitType
The conduit type to be searched for.
Return Value
Boolean
The Contains method returns True if the conduit type is within the set, otherwise False.
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace